Обновление sqlite3, чтобы подключить оконные функции

In [ ]:
!gdown --id 1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
!mv _sqlite3.cpython-37m-x86_64-linux-gnu.so /usr/lib/python3.7/lib-dynload/
import os
os.kill(os.getpid(), 9)

Downloading...
From: https://drive.google.com/uc?id=1BSHIKQ7rFw5BpTq5nw1UZfjPK_7Mpnbi
To: /content/_sqlite3.cpython-37m-x86_64-linux-gnu.so
100% 6.33M/6.33M [00:00<00:00, 88.5MB/s]

# Импорт библиотек

In [1]:
import pandas as pd
import numpy as np

In [2]:
import sqlite3

In [3]:
sqlite3.sqlite_version

'3.36.0'

# Подключение к базе

In [4]:
con = sqlite3.connect('db')

# Загрузка и чтение данных

In [5]:
!gdown --id 1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR

Downloading...
From: https://drive.google.com/uc?id=1Gj0qVU0Acv-HqRjTIEwvkO4TqJYijehR
To: /content/german_credit_augmented.csv
100% 69.6k/69.6k [00:00<00:00, 46.6MB/s]

In [6]:
df = pd.read_csv('/content/german_credit_augmented.csv')

In [7]:
df.head()

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [8]:
df['contract_dt'] = pd.to_datetime(df['contract_dt'],format='%Y-%m-%d %H:%M:%S')

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   age               1000 non-null   int64
 1   sex               1000 non-null   object
 2   job               1000 non-null   int64
 3   housing           1000 non-null   object
 4   saving_accounts   817 non-null    object
 5   checking_account  606 non-null    object
 6   credit_amount     1000 non-null   int64
 7   duration          1000 non-null   int64
 8   purpose           1000 non-null   object
 9   default           1000 non-null   int64
 10  contract_dt       1000 non-null   datetime64[ns]
 11  client_id         1000 non-null   int64
dtypes: datetime64[ns](1), int64(6), object(5)
memory usage: 93.9+ KB

Перевожу таблицу в sql

In [11]:
df.to_sql('german_credit',con,index=False,if_exists='replace')

# SELECT

Функция для отправки запроса и получения данных

In [12]:
def select(sql):
  return pd.read_sql(sql,con)

Проверка связи

In [13]:
sql = '''
SELECT 
  t.age * 3 AS age_mult3,
  t.housing
FROM 
  german_credit AS t
'''

In [14]:
select(sql)

     age_mult3 housing
0           99     own
1          129     own
2          156     own
3          105     own
4           84     own
..         ...     ...
995        195    free
996         90     own
997         99     own
998         87     own
999        132     own

[1000 rows x 2 columns]

## Манипуляции со столбцами

In [15]:
sql = '''
SELECT 
  t.*, 
  t.age * 3 as age_mult3,
  t.age + t.credit_amount as age_plus_amount,
  t.age * 1.0 / t.credit_amount as age_div_amount,
  t.age as age_2
FROM 
  german_credit t
'''

In [16]:
select(sql)

     age     sex  job  ... age_plus_amount age_div_amount age_2
0     33    male    2  ...            3107       0.010735    33
1     43    male    1  ...            1387       0.031994    43
2     52    male    2  ...             988       0.055556    52
3     35  female    3  ...            1428       0.025126    35
4     28    male    2  ...             804       0.036082    28
..   ...     ...  ...  ...             ...            ...   ...
995   65    male    2  ...            2665       0.025000    65
996   30    male    3  ...            4485       0.006734    30
997   33    male    2  ...            6436       0.005154    33
998   29  female    2  ...            5032       0.005797    29
999   44    male    2  ...            1848       0.024390    44

[1000 rows x 16 columns]

## Where

In [17]:
df.head()

   age     sex  job housing  ...    purpose default         contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0 2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0 2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0 2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0 2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0 2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [18]:
sql = '''
SELECT 
  * 
FROM 
  german_credit t 
LIMIT 
  5'''

In [19]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [20]:
sql = '''
SELECT 
  count(*) 
FROM 
  german_credit t 
WHERE 
  t.contract_dt BETWEEN '2007-01-01' AND '2007-12-31'
'''

In [21]:
select(sql)

   count(*)
0       573

In [22]:
sql = '''
SELECT 
  * 
FROM 
  german_credit t 
WHERE 
  t.contract_dt BETWEEN '2007-01-01' AND '2007-12-31'
  AND t.purpose IN ('car' ,'repairs')
ORDER BY 
  t.contract_dt DESC, 
  credit_amount 
'''

In [23]:
select(sql)

     age     sex  job housing  ...  purpose default          contract_dt  client_id
0     36    male    3    rent  ...      car       0  2007-12-29 16:10:08         99
1     30    male    2     own  ...  repairs       1  2007-12-28 17:09:43        127
2     25    male    2    rent  ...      car       1  2007-12-28 08:38:58        979
3     48    male    2     own  ...      car       0  2007-12-24 16:28:30         20
4     67  female    2     own  ...  repairs       0  2007-12-24 12:25:28        779
..   ...     ...  ...     ...  ...      ...     ...                  ...        ...
192   55    male    2     own  ...      car       0  2007-05-05 06:35:11        209
193   55  female    0    free  ...  repairs       1  2007-05-05 00:14:17        429
194   47    male    3     own  ...      car       1  2007-05-03 10:29:01        485
195   36    male    2     own  ...      car       1  2007-05-02 06:22:11        184
196   31    male    2     own  ...      car       1  2007-05-01 23:14:02        598

[197 rows x 12 columns]

## Like

In [24]:
t = pd.DataFrame({'purpose':['машина','на машину','на покупку машины','автомобиль','на возвращение 2007'],
                  'amount':[1000,400,600,700,1500]})

In [25]:
t

               purpose  amount
0               машина    1000
1            на машину     400
2    на покупку машины     600
3           автомобиль     700
4  на возвращение 2007    1500

In [26]:
t.to_sql('purpose',con,index=False,if_exists='replace')

In [27]:
sql = '''
SELECT 
  * 
FROM 
  purpose t
'''

In [28]:
select(sql)

               purpose  amount
0               машина    1000
1            на машину     400
2    на покупку машины     600
3           автомобиль     700
4  на возвращение 2007    1500

In [29]:
sql = '''
SELECT 
  * 
FROM 
  purpose t
WHERE 
  (t.purpose LIKE '%машин%'
  OR t.purpose LIKE '%авто%') 
  AND t.amount > 500
'''

In [30]:
select(sql)

             purpose  amount
0             машина    1000
1  на покупку машины     600
2         автомобиль     700

In [31]:
sql = '''
SELECT 
  count(*) 
FROM 
  german_credit t
WHERE 
  t.credit_amount > 1000
'''

In [32]:
select(sql)

   count(*)
0       884

In [35]:
sql = '''
SELECT 
  t.credit_amount,
  CASE WHEN t.credit_amount > 1000 THEN 1 ELSE 0 END AS greater_1000_flag,
  IIF(t.credit_amount > 1000,1,0) AS greater_1000_flag2
FROM 
  german_credit t
'''

In [36]:
select(sql)

     credit_amount  greater_1000_flag  greater_1000_flag2
0             3074                  1                   1
1             1344                  1                   1
2              936                  0                   0
3             1393                  1                   1
4              776                  0                   0
..             ...                ...                 ...
995           2600                  1                   1
996           4455                  1                   1
997           6403                  1                   1
998           5003                  1                   1
999           1804                  1                   1

[1000 rows x 3 columns]

In [37]:
sql = '''
SELECT 
  avg(CASE WHEN t.credit_amount > 1000 THEN 1 ELSE 0 END) AS greater_1000_frac
FROM 
  german_credit t'''

In [38]:
select(sql)

   greater_1000_frac
0              0.884

## Create table

In [39]:
sql = '''
SELECT 
  * 
FROM 
  german_credit t
WHERE 
  t.credit_amount > 1000
'''

In [40]:
select(sql)

     age     sex  job  ... default          contract_dt client_id
0     33    male    2  ...       0  2008-06-29 18:52:00       210
1     43    male    1  ...       0  2007-05-20 18:30:19       929
2     35  female    3  ...       0  2007-05-06 10:58:22        45
3     27  female    2  ...       0  2008-06-18 04:10:05        86
4     26    male    2  ...       1  2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                  ...       ...
879   65    male    2  ...       1  2007-12-16 20:17:19       624
880   30    male    3  ...       1  2007-07-12 14:08:58       181
881   33    male    2  ...       0  2008-04-08 03:24:26       730
882   29  female    2  ...       1  2007-11-29 15:51:45       557
883   44    male    2  ...       0  2007-08-14 09:05:33        23

[884 rows x 12 columns]

In [41]:
cur = con.cursor()

In [42]:
sql = '''
DROP TABLE IF EXISTS greater_1000_credit;

CREATE TABLE greater_1000_credit AS

SELECT 
  * 
FROM 
  german_credit t
WHERE 
  t.credit_amount > 1000'''

In [43]:
cur.executescript(sql)

In [44]:
sql = '''
SELECT 
  * 
FROM 
  greater_1000_credit t'''

In [45]:
select(sql)

     age     sex  job  ... default          contract_dt client_id
0     33    male    2  ...       0  2008-06-29 18:52:00       210
1     43    male    1  ...       0  2007-05-20 18:30:19       929
2     35  female    3  ...       0  2007-05-06 10:58:22        45
3     27  female    2  ...       0  2008-06-18 04:10:05        86
4     26    male    2  ...       1  2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                  ...       ...
879   65    male    2  ...       1  2007-12-16 20:17:19       624
880   30    male    3  ...       1  2007-07-12 14:08:58       181
881   33    male    2  ...       0  2008-04-08 03:24:26       730
882   29  female    2  ...       1  2007-11-29 15:51:45       557
883   44    male    2  ...       0  2007-08-14 09:05:33        23

[884 rows x 12 columns]

## Create table POSTGRES

In [46]:
from sqlalchemy import create_engine
con_pg = create_engine('postgresql+psycopg2://artoxeig:IeNTfTHOt3TKuBgRXNrXO6IybHwuShdF@hattie.db.elephantsql.com:5432/artoxeig')

/usr/local/lib/python3.7/dist-packages/psycopg2/__init__.py:144: UserWarning: The psycopg2 wheel package will be renamed from release 2.8; in order to keep installing from binary please use "pip install psycopg2-binary" instead. For details see: <http://initd.org/psycopg/docs/install.html#binary-install-from-pypi>.
  """)

In [47]:
def select_pg(sql):
  return pd.read_sql(sql,con_pg)

In [48]:
sql = '''
SELECT 
  * 
FROM 
  german_credit t
WHERE 
  t.credit_amount > 1000'''

In [49]:
select_pg(sql)

     age     sex  job  ... default         contract_dt client_id
0     33    male    2  ...       0 2008-06-29 18:52:00       210
1     43    male    1  ...       0 2007-05-20 18:30:19       929
2     35  female    3  ...       0 2007-05-06 10:58:22        45
3     27  female    2  ...       0 2008-06-18 04:10:05        86
4     26    male    2  ...       1 2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                 ...       ...
879   65    male    2  ...       1 2007-12-16 20:17:19       624
880   30    male    3  ...       1 2007-07-12 14:08:58       181
881   33    male    2  ...       0 2008-04-08 03:24:26       730
882   29  female    2  ...       1 2007-11-29 15:51:45       557
883   44    male    2  ...       0 2007-08-14 09:05:33        23

[884 rows x 12 columns]

In [50]:
sql = '''
DROP TABLE IF EXISTS greater_1000_credit;

CREATE TABLE greater_1000_credit AS

SELECT 
  * 
FROM 
  german_credit t
WHERE 
  t.credit_amount > 1000'''

In [51]:
con_pg.execute(sql)

In [52]:
sql = '''
SELECT 
  * 
FROM 
  greater_1000_credit t'''

In [53]:
select_pg(sql)

     age     sex  job  ... default         contract_dt client_id
0     33    male    2  ...       0 2008-06-29 18:52:00       210
1     43    male    1  ...       0 2007-05-20 18:30:19       929
2     35  female    3  ...       0 2007-05-06 10:58:22        45
3     27  female    2  ...       0 2008-06-18 04:10:05        86
4     26    male    2  ...       1 2007-11-29 00:20:44       639
..   ...     ...  ...  ...     ...                 ...       ...
879   65    male    2  ...       1 2007-12-16 20:17:19       624
880   30    male    3  ...       1 2007-07-12 14:08:58       181
881   33    male    2  ...       0 2008-04-08 03:24:26       730
882   29  female    2  ...       1 2007-11-29 15:51:45       557
883   44    male    2  ...       0 2007-08-14 09:05:33        23

[884 rows x 12 columns]

## Union all

In [54]:
jan = pd.DataFrame({'month':['jan','jan'],
                    'revenue':[1,2]})

feb = pd.DataFrame({'month':['feb','feb'],
                    'revenue':[1,2]})

In [55]:
jan.to_sql('jan',con,index=False,if_exists='replace')
feb.to_sql('feb',con,index=False,if_exists='replace')

In [56]:
sql = '''
SELECT 
  * 
FROM 
  jan t

UNION ALL

SELECT 
  *
FROM
  feb t'''

In [57]:
select(sql)

  month  revenue
0   jan        1
1   jan        2
2   feb        1
3   feb        2

In [58]:
sql = '''
SELECT 
  t.revenue
FROM 
  jan t

UNION

SELECT 
  t.revenue 
FROM 
  feb t'''

In [59]:
select(sql)

   revenue
0        1
1        2

In [60]:
sql = '''
SELECT 
  t.revenue,
  'jan' AS month
FROM 
  jan t

UNION ALL

SELECT 
  t.revenue,
  'mar' AS month
FROM
  feb t'''

In [61]:
select(sql)

   revenue month
0        1   jan
1        2   jan
2        1   mar
3        2   mar

## Специальные функции

In [62]:
sql = '''
SELECT 
  t.sex, 
  SUBSTR(t.sex,1,1) 
FROM 
  german_credit t'''

In [63]:
select(sql)

        sex SUBSTR(t.sex,1,1)
0      male                 m
1      male                 m
2      male                 m
3    female                 f
4      male                 m
..      ...               ...
995    male                 m
996    male                 m
997    male                 m
998  female                 f
999    male                 m

[1000 rows x 2 columns]

In [64]:
sql = '''
select 
  t.sex,
  SUBSTRING(t.sex,1,1),
  LEFT(t.sex,1)
FROM 
  german_credit t'''

In [65]:
select_pg(sql)

        sex substring left
0      male         m    m
1      male         m    m
2      male         m    m
3    female         f    f
4      male         m    m
..      ...       ...  ...
995    male         m    m
996    male         m    m
997    male         m    m
998  female         f    f
999    male         m    m

[1000 rows x 3 columns]

# GROUP BY

## Pivot table

In [66]:
sql = '''
SELECT
  t.sex,
  COUNT(*) AS cnt,
  AVG(t.credit_amount) AS credit_amount_avg
FROM 
  german_credit t
GROUP BY 
  1
 '''

In [67]:
select(sql)

      sex  cnt  credit_amount_avg
0  female  310        2877.774194
1    male  690        3448.040580

In [68]:
df.groupby('sex')['credit_amount'].agg(['count','mean'])

        count         mean
sex
female    310  2877.774194
male      690  3448.040580

In [69]:
sql = '''
SELECT 
  COUNT(distinct t.housing), 
  COUNT(t.housing) 
FROM 
  german_credit t'''

In [70]:
select(sql)

   COUNT(distinct t.housing)  COUNT(t.housing)
0                          3              1000

In [71]:
sql = '''
SELECT 
  t.housing,
  COUNT(*) AS cnt,
  AVG(t.credit_amount) AS credit_amount_avg
FROM 
  german_credit t
GROUP BY 
  1
'''

In [72]:
select(sql)

  housing  cnt  credit_amount_avg
0    free  108        4906.212963
1     own  713        3060.939691
2    rent  179        3122.553073

## Пропуски

In [73]:
sql = '''
SELECT 
  COUNT(t.checking_account), 
  COUNT(*) 
FROM 
  german_credit t'''

In [75]:
select(sql)

   COUNT(t.checking_account)  COUNT(*)
0                        606      1000

In [76]:
sql = '''
SELECT 
  t.checking_account,
  COUNT(*) AS cnt,
  AVG(t.credit_amount) AS credit_amount_avg
FROM 
  german_credit t
GROUP BY 
  1
'''

In [77]:
select(sql)

  checking_account  cnt  credit_amount_avg
0             None  394        3133.101523
1           little  274        3175.218978
2         moderate  269        3827.561338
3             rich   63        2177.650794

In [78]:
df.groupby('checking_account',dropna=False)['credit_amount'].count()

checking_account
little      274
moderate    269
rich         63
NaN         394
Name: credit_amount, dtype: int64

In [79]:
sql = '''
SELECT 
  SUM(CASE WHEN t.checking_account IS NULL THEN 1 ELSE 0 END) AS is_null,
  COUNT(CASE WHEN t.checking_account IS NULL THEN 1 ELSE null END) AS is_null2
FROM 
  german_credit t'''

In [80]:
select(sql)

   is_null  is_null2
0      394       394

In [81]:
t = pd.DataFrame({'col1':[1,np.nan,2]})

In [82]:
t

   col1
0   1.0
1   NaN
2   2.0

In [83]:
t.to_sql('null_test',con,index=False,if_exists='replace')

In [84]:
sql = '''
SELECT 
  AVG(t.col1) 
FROM 
  null_test t'''

In [85]:
select(sql)

   AVG(t.col1)
0          1.5

In [86]:
sql = '''
SELECT 
  AVG(COALESCE(t.col1,0))
FROM 
  null_test t'''

In [87]:
select(sql)

   AVG(COALESCE(t.col1,0))
0                      1.0

In [88]:
t = pd.DataFrame({'col1':[1,np.nan,2],
                  'col2':[np.nan,np.nan,1],
                  'col3':[1,2,3]})

In [89]:
t

   col1  col2  col3
0   1.0   NaN     1
1   NaN   NaN     2
2   2.0   1.0     3

In [90]:
t.to_sql('null_test',con,index=False,if_exists='replace')

In [91]:
sql = '''
SELECT 
  t.*, 
  COALESCE(t.col1,t.col2,t.col3)
FROM 
  null_test t'''

In [92]:
select(sql)

   col1  col2  col3  COALESCE(t.col1,t.col2,t.col3)
0   1.0   NaN     1                             1.0
1   NaN   NaN     2                             2.0
2   2.0   1.0     3                             2.0

## Дубликаты

In [93]:
t = pd.DataFrame({'id':[1,1,2],'name':['a','a','b']})

In [94]:
t

   id name
0   1    a
1   1    a
2   2    b

In [95]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [96]:
sql = '''
SELECT 
  * 
FROM 
  dupl_test t'''

In [97]:
select(sql)

   id name
0   1    a
1   1    a
2   2    b

In [98]:
sql = '''
select 
  t.id, 
  t.name, 
  COUNT(*) AS cnt 
FROM 
  dupl_test t
GROUP BY 
  t.id, t.name
'''

In [99]:
select(sql)

   id name  cnt
0   1    a    2
1   2    b    1

In [107]:
sql = '''
SELECT 
  t.id, 
  t.name, 
  COUNT(*) AS cnt 
FROM 
  dupl_test t
GROUP BY 
  1,2
HAVING 
  COUNT(*) > 1
'''

In [108]:
select(sql)

   id name  cnt
0   1    a    2

In [ ]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                  'name':['a','b','c','d','e']})

In [102]:
t

   id name
0   1    a
1   1    a
2   2    b

In [103]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [105]:
sql = '''
SELECT 
  * 
FROM 
  dupl_test t'''

In [106]:
select(sql)

   id name
0   1    a
1   1    a
2   2    b

In [109]:
sql = '''
SELECT 
  t.id, 
  COUNT(*) AS cnt 
FROM 
  dupl_test t
GROUP BY 
  1
HAVING 
  COUNT(*) > 1
'''

In [110]:
select(sql)

   id  cnt
0   1    2

In [112]:
sql = '''
SELECT 
  *
FROM 
  dupl_test t
WHERE 
  t.id IN (1,2)'''

In [113]:
select(sql)

   id name
0   1    a
1   1    a
2   2    b

In [114]:
sql = '''
SELECT 
  t.id AS cnt 
FROM 
  dupl_test t
GROUP BY
  1
HAVING 
  COUNT(*) > 1
'''

In [115]:
select(sql)

   cnt
0    1

In [116]:
sql = '''
SELECT 
  * 
FROM 
  dupl_test t
WHERE 
  t.id IN (SELECT 
              t.id AS cnt 
           FROM 
              dupl_test t
           GROUP BY 
              1
           HAVING 
              COUNT(*) > 1)'''

In [117]:
select(sql)

   id name
0   1    a
1   1    a

## Агрегация

In [118]:
sql = '''
SELECT 
  DATE(t.contract_dt,'start of month') AS month,
  COUNT(*) AS credit_cnt,
  COUNT(DISTINCT t.client_id) AS client_id_unique,
  SUM(t.credit_amount) AS credit_amount_sum,
  AVG(t.credit_amount) AS credit_amount_avg
FROM 
  german_credit t
GROUP BY 
  1
ORDER BY 
  1
'''

In [119]:
select(sql)

         month  credit_cnt  ...  credit_amount_sum  credit_amount_avg
0   2007-05-01          81  ...             207663        2563.740741
1   2007-06-01          74  ...             239594        3237.756757
2   2007-07-01          71  ...             224333        3159.619718
3   2007-08-01          57  ...             178569        3132.789474
4   2007-09-01          58  ...             186909        3222.568966
5   2007-10-01          70  ...             188534        2693.342857
6   2007-11-01          87  ...             300504        3454.068966
7   2007-12-01          77  ...             273973        3558.090909
8   2008-01-01          93  ...             288080        3097.634409
9   2008-02-01          55  ...             211128        3838.690909
10  2008-03-01          63  ...             204944        3253.079365
11  2008-04-01          85  ...             305409        3593.047059
12  2008-05-01          67  ...             263043        3926.014925
13  2008-06-01          62  ...             198575        3202.822581

[14 rows x 5 columns]

In [120]:
pd.Series(range(600)).sample(1000,replace=True)

53      53
546    546
112    112
568    568
451    451
      ...
214    214
281    281
196    196
541    541
419    419
Length: 1000, dtype: int64

In [121]:
df['client_id_2'] = pd.Series(range(600)).sample(1000,replace=True).values

In [122]:
df.to_sql('german_credit_not_unieque',con,index=False,if_exists='replace')

In [123]:
sql = '''
SELECT 
  DATE(t.contract_dt,'start of month') AS month,
  COUNT(*) AS credit_cnt,
  COUNT(DISTINCT t.client_id_2) AS client_id_unique,
  SUM(t.credit_amount) AS credit_amount_sum,
  AVG(t.credit_amount) AS credit_amount_avg
FROM 
  german_credit_not_unieque t
GROUP BY
  1
ORDER BY 
  1
 '''

In [124]:
select(sql)

         month  credit_cnt  ...  credit_amount_sum  credit_amount_avg
0   2007-05-01          81  ...             207663        2563.740741
1   2007-06-01          74  ...             239594        3237.756757
2   2007-07-01          71  ...             224333        3159.619718
3   2007-08-01          57  ...             178569        3132.789474
4   2007-09-01          58  ...             186909        3222.568966
5   2007-10-01          70  ...             188534        2693.342857
6   2007-11-01          87  ...             300504        3454.068966
7   2007-12-01          77  ...             273973        3558.090909
8   2008-01-01          93  ...             288080        3097.634409
9   2008-02-01          55  ...             211128        3838.690909
10  2008-03-01          63  ...             204944        3253.079365
11  2008-04-01          85  ...             305409        3593.047059
12  2008-05-01          67  ...             263043        3926.014925
13  2008-06-01          62  ...             198575        3202.822581

[14 rows x 5 columns]

## Интервалы (или бины или бакеты)

In [125]:
sql = '''
select 
  COUNT(DISTINCT t.credit_amount) 
FROM 
  german_credit t'''

In [126]:
select(sql)

   COUNT(DISTINCT t.credit_amount)
0                              921

In [128]:
sql = '''
SELECT 
  t.credit_amount,
  CASE WHEN t.credit_amount < 1000 THEN '1. <1000'
       WHEN t.credit_amount < 2000 THEN '2. 1000-2000' 
       WHEN t.credit_amount < 3000 THEN '3. 2000-3000'
       WHEN t.credit_amount >= 3000 THEN '4. >= 3000'
       ELSE 'other' END AS credit_amount_bin
FROM 
  german_credit t'''

In [129]:
select(sql)

     credit_amount credit_amount_bin
0             3074        4. >= 3000
1             1344      2. 1000-2000
2              936          1. <1000
3             1393      2. 1000-2000
4              776          1. <1000
..             ...               ...
995           2600      3. 2000-3000
996           4455        4. >= 3000
997           6403        4. >= 3000
998           5003        4. >= 3000
999           1804      2. 1000-2000

[1000 rows x 2 columns]

In [130]:
sql = '''
SELECT 
  t.credit_amount,
  CASE WHEN t.credit_amount < 1000 THEN '1. <1000'
       WHEN t.credit_amount < 2000 THEN '2. 1000-2000' 
       WHEN t.credit_amount < 3000 THEN '3. 2000-3000'
       WHEN t.credit_amount >= 3000 THEN '4. >= 3000'
       ELSE 'other' END AS credit_amount_bin
FROM 
  german_credit t
GROUP BY 
  1
 '''

In [131]:
select(sql)

     credit_amount credit_amount_bin
0              250          1. <1000
1              276          1. <1000
2              338          1. <1000
3              339          1. <1000
4              343          1. <1000
..             ...               ...
916          15653        4. >= 3000
917          15672        4. >= 3000
918          15857        4. >= 3000
919          15945        4. >= 3000
920          18424        4. >= 3000

[921 rows x 2 columns]

## Столбцы сводной таблицы

In [133]:
sql = '''
select 
  t.housing, 
  COUNT(CASE WHEN t.sex = 'female' THEN 1 ELSE null END) AS female,
  COUNT(CASE WHEN t.sex = 'male' THEN 1 ELSE null END) AS male,
  COUNT(*) AS cnt 
FROM 
  german_credit t
GROUP BY 
  1'''

In [134]:
select(sql)

  housing  female  male  cnt
0    free      19    89  108
1     own     196   517  713
2    rent      95    84  179

In [135]:
sql = '''
SELECT 
  DISTINCT t.purpose 
FROM 
  german_credit t'''

In [136]:
purpose = list(select(sql)['purpose'].values)

In [137]:
purpose

['radio/TV',
 'car',
 'education',
 'furniture/equipment',
 'repairs',
 'business',
 'domestic appliances',
 'vacation/others']

In [139]:
for p in purpose:
  print(f"COUNT(CASE WHEN t.purpose = '{p}' THEN 1 ELSE null END) AS {p.lower().replace(' ','').replace('/','')},")

COUNT(CASE WHEN t.purpose = 'radio/TV' THEN 1 ELSE null END) AS radiotv,
COUNT(CASE WHEN t.purpose = 'car' THEN 1 ELSE null END) AS car,
COUNT(CASE WHEN t.purpose = 'education' THEN 1 ELSE null END) AS education,
COUNT(CASE WHEN t.purpose = 'furniture/equipment' THEN 1 ELSE null END) AS furnitureequipment,
COUNT(CASE WHEN t.purpose = 'repairs' THEN 1 ELSE null END) AS repairs,
COUNT(CASE WHEN t.purpose = 'business' THEN 1 ELSE null END) AS business,
COUNT(CASE WHEN t.purpose = 'domestic appliances' THEN 1 ELSE null END) AS domesticappliances,
COUNT(CASE WHEN t.purpose = 'vacation/others' THEN 1 ELSE null END) AS vacationothers,

In [141]:
sql = '''
SELECT 
  t.housing, 
  COUNT(CASE WHEN t.purpose = 'radio/TV' THEN 1 ELSE null END) AS radiotv,
  COUNT(CASE WHEN t.purpose = 'car' THEN 1 ELSE null END) AS car,
  COUNT(CASE WHEN t.purpose = 'education' THEN 1 ELSE null END) AS education,
  COUNT(CASE WHEN t.purpose = 'furniture/equipment' THEN 1 ELSE null END) AS furnitureequipment,
  COUNT(CASE WHEN t.purpose = 'repairs' THEN 1 ELSE null END) AS repairs,
  COUNT(CASE WHEN t.purpose = 'business' THEN 1 ELSE null END) AS business,
  COUNT(CASE WHEN t.purpose = 'domestic appliances' THEN 1 ELSE null END) AS domesticappliances,
  COUNT(CASE WHEN t.purpose = 'vacation/others' THEN 1 ELSE null END) AS vacationothers,
  COUNT(*) AS cnt 
FROM 
  german_credit t
GROUP BY 
  1'''

In [142]:
select(sql)

  housing  radiotv  car  ...  domesticappliances  vacationothers  cnt
0    free       15   55  ...                   0               4  108
1     own      227  219  ...                  10               8  713
2    rent       38   63  ...                   2               0  179

[3 rows x 10 columns]

## Категории из текстовых данных

In [143]:
t = pd.DataFrame({'purpose':['машина','машина','машина','на машину','на покупку машины',
                             'автомобиль','на возвращение 2007', 
                             'на свадьбу','свадьба','свадьба','свадьба','для свадьбы',
                             'недвижимость','на покупку недвижимости']})

In [144]:
t

                    purpose
0                    машина
1                    машина
2                    машина
3                 на машину
4         на покупку машины
5                автомобиль
6       на возвращение 2007
7                на свадьбу
8                   свадьба
9                   свадьба
10                  свадьба
11              для свадьбы
12             недвижимость
13  на покупку недвижимости

In [145]:
t.to_sql('purpose',con,index=False,if_exists='replace')

In [146]:
df.head()

   age     sex  job  ...         contract_dt client_id client_id_2
0   33    male    2  ... 2008-06-29 18:52:00       210         413
1   43    male    1  ... 2007-05-20 18:30:19       929         227
2   52    male    2  ... 2008-04-27 08:23:07       200         278
3   35  female    3  ... 2007-05-06 10:58:22        45         151
4   28    male    2  ... 2007-07-21 13:22:14       358         375

[5 rows x 13 columns]

In [147]:
sql = '''
SELECT 
  * 
FROM 
  purpose t'''

In [148]:
select(sql)

                    purpose
0                    машина
1                    машина
2                    машина
3                 на машину
4         на покупку машины
5                автомобиль
6       на возвращение 2007
7                на свадьбу
8                   свадьба
9                   свадьба
10                  свадьба
11              для свадьбы
12             недвижимость
13  на покупку недвижимости

In [ ]:
sql = '''
SELECT 
  t.purpose, 
  COUNT(*) 
FROM 
  purpose t
GROUP BY 
  t.purpose
ORDER BY 
  2 DESC'''

In [149]:
select(sql)

                    purpose
0                    машина
1                    машина
2                    машина
3                 на машину
4         на покупку машины
5                автомобиль
6       на возвращение 2007
7                на свадьбу
8                   свадьба
9                   свадьба
10                  свадьба
11              для свадьбы
12             недвижимость
13  на покупку недвижимости

In [181]:
cat = '''
SELECT 
  t.purpose,
  CASE WHEN t.purpose LIKE '%свадьб%' THEN 'свадьба'
       WHEN t.purpose LIKE '%машин%' OR t.purpose LIKE '%авто%' THEN 'машина'
       WHEN t.purpose LIKE '%недвиж%' THEN 'недвижимость'
       ELSE 'другое' END AS purpose_cat
FROM 
  purpose t'''

In [151]:
select(cat)

                    purpose   purpose_cat
0                    машина        машина
1                    машина        машина
2                    машина        машина
3                 на машину        машина
4         на покупку машины        машина
5                автомобиль        машина
6       на возвращение 2007        другое
7                на свадьбу       свадьба
8                   свадьба       свадьба
9                   свадьба       свадьба
10                  свадьба       свадьба
11              для свадьбы       свадьба
12             недвижимость  недвижимость
13  на покупку недвижимости  недвижимость

In [152]:
sql = f'''
SELECT 
  t.purpose_cat,
  COUNT(*)
FROM 
  ({cat}) t
GROUP BY 
  t.purpose_cat'''

In [153]:
select(sql)

    purpose_cat  COUNT(*)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [156]:
sql = f'''
SELECT 
  t.purpose, 
  COUNT(*) 
FROM 
  ({cat}) t
WHERE 
  t.purpose_cat = 'другое'
GROUP BY 
  t.purpose
ORDER BY 
  2 desc'''

In [157]:
select(sql)

               purpose  COUNT(*)
0  на возвращение 2007         1

# Подзапросы

## Обычный подзапрос

In [158]:
t = pd.DataFrame({'id':[1,1,2,2,3],
                  'name':['a','b','c','d','e']})

In [159]:
t

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [160]:
t.to_sql('dupl_test',con,index=False,if_exists='replace')

In [161]:
sql = '''
SELECT 
  * 
FROM 
  dupl_test t'''

In [162]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d
4   3    e

In [163]:
sql = '''
SELECT 
  t.id 
FROM 
  dupl_test t
GROUP BY 
  1
HAVING 
  count(*) > 1'''

In [164]:
select(sql)

   id
0   1
1   2

In [165]:
sql = '''
SELECT 
  * 
FROM
  dupl_test t
WHERE 
  t.id IN (SELECT 
              t.id 
           FROM 
              dupl_test t
           GROUP BY 
              1
           HAVING 
              COUNT(*) > 1)'''

In [166]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [167]:
sql = '''
DROP TABLE IF EXISTS dupls;

CREATE TABLE dupls AS

SELECT 
  t.id 
FROM 
  dupl_test t
GROUP BY 
  1
HAVING 
  COUNT(*) > 1'''

In [168]:
cur.executescript(sql)

In [169]:
sql = '''
SELECT 
  * 
FROM 
  dupls t'''

In [170]:
select(sql)

   id
0   1
1   2

In [171]:
sql = '''
SELECT 
  * 
FROM 
  dupl_test t
WHERE 
  t.id IN dupls'''

In [172]:
select(sql)

   id name
0   1    a
1   1    b
2   2    c
3   2    d

In [173]:
sql = '''
SELECT 
  * 
FROM 
  (SELECT 
    t.id,
    COUNT(*) AS cnt 
   FROM 
    dupl_test t
   GROUP BY 
    t.id) t
WHERE 
  t.cnt > 1
'''

In [174]:
select(sql)

   id  cnt
0   1    2
1   2    2

## CTE (with)

In [175]:
sql = '''
SELECT 
  * 
FROM 
  (SELECT 
     * 
   FROM 
     (SELECT 
        t.id,
        COUNT(*) AS cnt 
      FROM 
        dupl_test t
      GROUP BY 
        1) t
      WHERE 
        t.cnt > 1) t
WHERE 
  t.id = 1
'''

In [176]:
select(sql)

   id  cnt
0   1    2

In [177]:
sql = '''
WITH id_cnt AS (
SELECT 
  t.id,
  COUNT(*) AS cnt 
FROM 
  dupl_test t
group by 
  1),

id_cnt_2 AS (
SELECT 
  *
FROM 
  id_cnt t
WHERE 
  t.cnt > 1)

SELECT 
  * 
FROM 
  id_cnt_2 t
WHERE 
  t.id = 1
'''

In [178]:
select(sql)

   id  cnt
0   1    2

In [182]:
sql = f'''
SELECT 
  t.purpose_cat,
  COUNT(*)
FROM 
  ({cat}) t
GROUP BY 
  t.purpose_cat'''

In [183]:
print(sql)

SELECT
  t.purpose_cat,
  COUNT(*)
FROM
  (
SELECT
  t.purpose,
  CASE WHEN t.purpose LIKE '%свадьб%' THEN 'свадьба'
       WHEN t.purpose LIKE '%машин%' OR t.purpose LIKE '%авто%' THEN 'машина'
       WHEN t.purpose LIKE '%недвиж%' THEN 'недвижимость'
       ELSE 'другое' END AS purpose_cat
FROM
  purpose t) t
GROUP BY
  t.purpose_cat

In [184]:
sql = '''
with categories as (
SELECT 
  t.purpose,
  CASE WHEN t.purpose LIKE '%свадьб%' THEN 'свадьба'
       WHEN t.purpose LIKE '%машин%' OR t.purpose LIKE '%авто%' THEN 'машина'
       WHEN t.purpose LIKE '%недвиж%' THEN 'недвижимость'
       ELSE 'другое' END AS purpose_cat
FROM 
  purpose t)
 
SELECT 
  t.purpose_cat,
  COUNT(1) 
FROM 
  categories t
GROUP BY 
  1
'''

In [185]:
select(sql)

    purpose_cat  COUNT(1)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

## Когда лучше создавать таблицы

In [186]:
sql = '''
DROP TABLE IF EXISTS categories;
CREATE TABLE categories AS

SELECT 
  t.purpose,
  CASE WHEN t.purpose LIKE '%свадьб%' THEN 'свадьба'
       WHEN t.purpose LIKE '%машин%' OR t.purpose like '%авто%' THEN 'машина'
       WHEN t.purpose LIKE '%недвиж%' THEN 'недвижимость'
       ELSE 'другое' END AS purpose_cat
FROM 
  purpose t'''

In [187]:
cur.executescript(sql)

In [188]:
sql = '''
SELECT 
  * 
FROM 
  categories t'''

In [189]:
select(sql)

                    purpose   purpose_cat
0                    машина        машина
1                    машина        машина
2                    машина        машина
3                 на машину        машина
4         на покупку машины        машина
5                автомобиль        машина
6       на возвращение 2007        другое
7                на свадьбу       свадьба
8                   свадьба       свадьба
9                   свадьба       свадьба
10                  свадьба       свадьба
11              для свадьбы       свадьба
12             недвижимость  недвижимость
13  на покупку недвижимости  недвижимость

In [190]:
sql = f'''
SELECT 
  t.purpose_cat,
  COUNT(*)
FROM 
  categories t
GROUP BY 
  t.purpose_cat'''

In [191]:
select(sql)

    purpose_cat  COUNT(*)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [192]:
sql = f'''
SELECT 
  t.purpose, 
  COUNT(*) 
FROM 
  categories t
WHERE 
  t.purpose_cat = 'другое'
GROUP BY 
  1
ORDER BY 
  2 DESC'''

In [193]:
select(sql)

               purpose  COUNT(*)
0  на возвращение 2007         1

In [194]:
sql = '''
WITH categories AS (
SELECT 
  1
FROM
  purpose t)

SELECT 
  * 
FROM 
  categories t
'''

In [195]:
select(sql)

    1
0   1
1   1
2   1
3   1
4   1
5   1
6   1
7   1
8   1
9   1
10  1
11  1
12  1
13  1

# Джойны

## Лефт и иннер джоин

In [196]:
sql = '''
SELECT 
  * 
FROM 
  german_credit t 
LIMIT 
  5'''

In [197]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [198]:
users = pd.DataFrame({'id':[1,2,3],
                      'name':['alex','jon snow','tyrion']})

In [199]:
users

   id      name
0   1      gleb
1   2  jon snow
2   3    tyrion

In [200]:
items = pd.DataFrame({'user_id':[1,3,3],
                      'item_name':['alex','gold','wine'],
                      'value':[5,100,20]})

In [201]:
items

   user_id item_name  value
0        1      alex      5
1        3      gold    100
2        3      wine     20

In [202]:
users.to_sql('users',con,index=False,if_exists='replace')
items.to_sql('items',con,index=False,if_exists='replace')

In [203]:
sql = '''
SELECT 
  t.*, 
  i.item_name, 
  i.value, 
  i.user_id 
FROM 
  users t
LEFT JOIN 
  items i ON t.id = i.user_id
'''

In [204]:
select(sql)

   id      name item_name  value  user_id
0   1      gleb      alex    5.0      1.0
1   2  jon snow      None    NaN      NaN
2   3    tyrion      gold  100.0      3.0
3   3    tyrion      wine   20.0      3.0

In [205]:
sql = '''
SELECT 
  t.*,
  i.item_name 
FROM 
  users t
JOIN 
  items i ON t.id = i.user_id
'''

In [206]:
select(sql)

   id    name item_name
0   1    gleb      alex
1   3  tyrion      gold
2   3  tyrion      wine

In [207]:
sql = '''
SELECT 
  t.*, 
  i.item_name 
FROM 
  users t
LEFT JOIN 
  items i ON t.id = i.user_id
WHERE 
  i.item_name IS NOT NULL
'''

In [208]:
select(sql)

   id    name item_name
0   1    gleb      alex
1   3  tyrion      gold
2   3  tyrion      wine

## Агрегируй перед тем как джойнить

In [209]:
users = pd.DataFrame({'id':[1,2,3],
                      'name':['alex','jon snow','tyrion'],
                      'victory':[2,10,1]})

In [210]:
users.to_sql('users',con,index=False,if_exists='replace')

In [211]:
sql = '''
SELECT 
  t.*, 
  i.item_name, 
  i.value, 
  i.user_id 
FROM 
  users t
LEFT JOIN 
  items i ON t.id = i.user_id
'''

In [212]:
t = select(sql)

In [213]:
t

   id      name  victory item_name  value  user_id
0   1      alex        2      alex    5.0      1.0
1   2  jon snow       10      None    NaN      NaN
2   3    tyrion        1      gold  100.0      3.0
3   3    tyrion        1      wine   20.0      3.0

In [214]:
t['victory'].sum()

14

In [215]:
sql = '''
SELECT 
  SUM(t.victory) 
FROM 
  users t'''

In [216]:
select(sql)

   SUM(t.victory)
0              13

In [217]:
sql = '''
SELECT 
  t.*, 
  i.item_name, 
  i.value, 
  i.user_id 
FROM 
  users t
JOIN 
  items i ON t.id = i.user_id
'''

In [218]:
select(sql)

   id    name  victory item_name  value  user_id
0   1    alex        2      alex      5        1
1   3  tyrion        1      gold    100        3
2   3  tyrion        1      wine     20        3

In [219]:
sql = '''
SELECT 
  t.id, 
  t.name, 
  t.victory,
  COUNT(i.item_name) AS item_cnt,
  COALESCE(SUM(i.value),0) AS value_sum
FROM 
  users t
LEFT JOIN 
  items i ON t.id = i.user_id
GROUP BY 
  t.id, 
  t.name, 
  t.victory
'''

In [220]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      alex        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

In [221]:
sql = '''
SELECT 
  t.user_id, 
  COUNT(t.item_name) AS item_cnt,
  SUM(value) AS value_sum 
FROM 
  items t
GROUP BY 
  t.user_id'''

In [222]:
select(sql)

   user_id  item_cnt  value_sum
0        1         1          5
1        3         2        120

In [223]:
sql = '''
WITH items_agg AS (
SELECT 
  t.user_id, 
  COUNT(t.item_name) AS item_cnt,
  SUM(value) AS value_sum 
FROM 
  items t
GROUP BY 
  1)

SELECT 
  t.id, 
  t.name,
  t.victory,
  COALESCE(i.item_cnt,0) AS item_cnt,
  COALESCE(i.value_sum,0) AS value_sum
FROM 
  users t
LEFT JOIN 
  items_agg i ON t.id = i.user_id
'''

In [224]:
select(sql)

   id      name  victory  item_cnt  value_sum
0   1      alex        2         1          5
1   2  jon snow       10         0          0
2   3    tyrion        1         2        120

## Full join

In [225]:
sql = '''
SELECT 
  t.*, 
  i.* 
FROM 
  users t
FULL JOIN 
  items i ON t.id = i.user_id'''

In [226]:
select_pg(sql)

    id      name  user_id item_name  value
0  1.0      gleb      1.0      hleb    5.0
1  2.0  jon snow      NaN      None    NaN
2  3.0    tyrion      3.0      gold  100.0
3  3.0    tyrion      3.0      wine   20.0
4  NaN      None      4.0     sword   50.0

In [227]:
sql = '''
SELECT 
  t.*, 
  i.* 
FROM 
  users t
LEFT JOIN 
  items i ON t.id = i.user_id

union

SELECT 
  u.*, 
  t.* 
FROM 
  items t 
LEFT JOIN 
  users u ON t.user_id = u.id
'''

In [228]:
select(sql)

   id      name  victory  user_id item_name  value
0   1      alex        2      1.0      alex    5.0
1   2  jon snow       10      NaN      None    NaN
2   3    tyrion        1      3.0      gold  100.0
3   3    tyrion        1      3.0      wine   20.0

## Inner join

In [229]:
sql = '''
SELECT 
  * 
FROM 
  german_credit t 
LIMIT 
  5'''

In [230]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

In [231]:
clients = pd.DataFrame({'client_id':[200,45],
                        'data':[1,2]})

In [232]:
clients.to_sql('clients_task_name',con,index=False,if_exists='replace')

In [233]:
sql = '''
SELECT 
  t.*, 
  ctn.data 
FROM 
  german_credit t 
JOIN 
  clients_task_name ctn ON t.client_id = ctn.client_id
'''

In [234]:
select(sql)

   age     sex  job housing  ... default          contract_dt  client_id  data
0   52    male    2     own  ...       0  2008-04-27 08:23:07        200     1
1   35  female    3     own  ...       0  2007-05-06 10:58:22         45     2

[2 rows x 13 columns]

In [235]:
sql = '''
SELECT 
  1 AS user_id

UNION ALL

SELECT 
  2 AS user_id

UNION ALL

SELECT 
  3 AS user_id'''

In [236]:
select(sql)

   user_id
0        1
1        2
2        3

In [237]:
sql = '''
select 
  DATE('2021-03-01') AS month

UNION ALL

SELECT 
  DATE('2021-04-01') AS month
'''

In [238]:
select(sql)

        month
0  2021-03-01
1  2021-04-01

In [239]:
sql = '''
WITH users AS (
SELECT 
  1 AS user_id

UNION ALL

SELECT 
  2 AS user_id

UNION ALL

SELECT
   3 AS user_id),

month AS (
SELECT 
  DATE('2021-03-01') AS month

UNION ALL

SELECT 
  DATE('2021-04-01') AS month)

SELECT 
  * 
FROM 
  users t
JOIN 
  month m ON 1=1
'''

In [240]:
select(sql)

   user_id       month
0        1  2021-03-01
1        2  2021-03-01
2        3  2021-03-01
3        1  2021-04-01
4        2  2021-04-01
5        3  2021-04-01

## Ежемесячный отчет

In [241]:
sql = '''
SELECT 
  * 
FROM 
  german_credit t 
LIMIT 
  5'''

In [242]:
select(sql)

   age     sex  job housing  ...    purpose default          contract_dt  client_id
0   33    male    2     own  ...   radio/TV       0  2008-06-29 18:52:00        210
1   43    male    1     own  ...        car       0  2007-05-20 18:30:19        929
2   52    male    2     own  ...  education       0  2008-04-27 08:23:07        200
3   35  female    3     own  ...        car       0  2007-05-06 10:58:22         45
4   28    male    2     own  ...   radio/TV       0  2007-07-21 13:22:14        358

[5 rows x 12 columns]

https://drive.google.com/file/d/1ksjv4EsLItdn9rYA4oxislish-c4eE4D/view?usp=sharing

In [243]:
! gdown --id 1ksjv4EsLItdn9rYA4oxislish-c4eE4D

Downloading...
From: https://drive.google.com/uc?id=1ksjv4EsLItdn9rYA4oxislish-c4eE4D
To: /content/german_credit_augmented_transactions.csv
100% 134k/134k [00:00<00:00, 49.3MB/s]

In [244]:
transactions = pd.read_csv('/content/german_credit_augmented_transactions.csv')

In [245]:
transactions.head()

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [246]:
transactions.to_sql('client_transactions',con,index=False,if_exists='replace')

In [247]:
sql = '''
SELECT 
  * 
FROM 
  client_transactions t 
LIMIT 
  5'''

In [248]:
select(sql)

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [250]:
sql = '''
SELECT 
  COUNT(*) 
FROM 
  client_transactions t 
LIMIT 
  5'''

In [251]:
select(sql)

   COUNT(*)
0      4275

In [252]:
sql = '''
SELECT 
  DATE(t.dt, 'start of month') AS month,
  COUNT(*) AS transaction_cnt,
  SUM(t.amount) AS amount_sum
FROM
  client_transactions t
GROUP BY 
  1
ORDER BY 
  1
'''

In [253]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-10-01              332   634846.49
5   2007-11-01              389   500420.98
6   2007-12-01              364   561449.89
7   2008-01-01              413   630137.22
8   2008-02-01              228   337043.47
9   2008-03-01              309   425599.09
10  2008-04-01              383   677194.97
11  2008-05-01              310   474962.34
12  2008-06-01              271   383710.84

In [254]:
min = '''
SELECT 
  DATE(MIN(t.dt),'start of month') 
FROM 
  client_transactions t'''

In [255]:
max = '''
SELECT 
  DATE(max(t.dt),'start of month') 
FROM 
  client_transactions t'''

In [256]:
select(max)

  DATE(max(t.dt),'start of month')
0                       2008-06-01

In [257]:
sql = f'''WITH RECURSIVE dates(month) AS (
  VALUES(({min}))

  UNION ALL

  SELECT 
    date(month, '+1 month')
  FROM 
    dates
  WHERE 
    month < ({max})
)
SELECT 
  t.month 
FROM 
  dates t'''

In [258]:
select(sql)

         month
0   2007-05-01
1   2007-06-01
2   2007-07-01
3   2007-08-01
4   2007-09-01
5   2007-10-01
6   2007-11-01
7   2007-12-01
8   2008-01-01
9   2008-02-01
10  2008-03-01
11  2008-04-01
12  2008-05-01
13  2008-06-01

In [260]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))

  UNION ALL

  SELECT 
    DATE(month, '+1 month')
  FROM 
    dates
  WHERE 
    month < ({max})
),

trans_month AS (
  SELECT 
    DATE(t.dt, 'start of month') AS month,
    COUNT(*) AS transaction_cnt,
    SUM(t.amount) AS amount_sum
  FROM 
    client_transactions t
  GROUP BY 
    1
  ORDER BY 
    1)


SELECT 
  t.month,
  COALESCE(tm.transaction_cnt,0) AS transaction_cnt,
  COALESCE(tm.amount_sum,0) AS amount_sum
FROM 
  dates t
LEFT JOIN 
  trans_month tm ON t.month = tm.month
ORDER BY 
  1'''

In [261]:
select(sql)

         month  transaction_cnt  amount_sum
0   2007-05-01              338   450912.77
1   2007-06-01              379   551664.83
2   2007-07-01              304   494134.50
3   2007-08-01              255   426903.23
4   2007-09-01                0        0.00
5   2007-10-01              332   634846.49
6   2007-11-01              389   500420.98
7   2007-12-01              364   561449.89
8   2008-01-01              413   630137.22
9   2008-02-01              228   337043.47
10  2008-03-01              309   425599.09
11  2008-04-01              383   677194.97
12  2008-05-01              310   474962.34
13  2008-06-01              271   383710.84

## Ежемесячный отчет на пользователя

In [263]:
sql = '''
SELECT 
  DISTINCT t.client_id 
FROM 
  german_credit t'''

In [264]:
select(sql)

     client_id
0          210
1          929
2          200
3           45
4          358
..         ...
995        624
996        181
997        730
998        557
999         23

[1000 rows x 1 columns]

In [265]:
sql = '''
select 
  DATE(t.dt, 'start of month') AS month,
  t.client_id,
  COUNT(*) AS transaction_cnt,
  SUM(t.amount) AS amount_sum
FROM 
  client_transactions t
GROUP BY 
  1,2
ORDER BY 
  1'''

In [266]:
select(sql)

           month  client_id  transaction_cnt  amount_sum
0     2007-05-01        101                1      149.67
1     2007-05-01        107                2      217.50
2     2007-05-01        110                1     1081.32
3     2007-05-01        111                1      139.97
4     2007-05-01        113                1     1051.29
...          ...        ...              ...         ...
3551  2008-06-01        983                1    10050.37
3552  2008-06-01        987                1      192.48
3553  2008-06-01        992                1     -610.21
3554  2008-06-01        996                1      121.28
3555  2008-06-01        999                1     -641.25

[3556 rows x 4 columns]

In [267]:
sql = f'''WITH dates(month) AS (
  VALUES(({min}))
  
  UNION ALL

  SELECT 
    date(month, '+1 month')
  FROM 
    dates
  WHERE 
    month < ({max})
),

clients AS (
  SELECT 
    DISTINCT t.client_id 
  FROM 
    german_credit t),

clients_month AS
(SELECT 
  t.month, 
  c.client_id 
FROM 
  dates t
JOIN 
  clients c ON 1=1),

trans_month AS 

(SELECT 
  DATE(t.dt, 'start of month') AS month,
  t.client_id,
  COUNT(*) AS transaction_cnt,
  SUM(t.amount) AS amount_sum
FROM 
  client_transactions t
GROUP BY 
  1,2
ORDER BY 
  1),

client_trans_month AS (

SELECT 
  t.*,
  tm.transaction_cnt,
  tm.amount_sum,
  1 AS user,
  CASE WHEN tm.transaction_cnt > 0 THEN 1 ELSE 0 END AS active
FROM 
  clients_month t
LEFT JOIN 
  trans_month tm ON t.client_id = tm.client_id
  AND t.month = tm.month
)

SELECT 
  t.month, 
  SUM(t.user) AS user_cnt, 
  SUM(t.amount_sum) AS amount_sum , 
  SUM(t.active) AS active_cnt
FROM 
  client_trans_month t
GROUP BY  
  1
'''

In [268]:
t = select(sql)

In [269]:
sql = '''
SELECT 
  SUM(t.amount) 
FROM 
  client_transactions t'''

In [270]:
select(sql)

   SUM(t.amount)
0     6548980.62

In [271]:
t['amount_sum'].sum()

6548980.619999999

In [272]:
t

         month  user_cnt  amount_sum  active_cnt
0   2007-05-01      1000   450912.77         288
1   2007-06-01      1000   551664.83         297
2   2007-07-01      1000   494134.50         259
3   2007-08-01      1000   426903.23         222
4   2007-09-01      1000         NaN           0
5   2007-10-01      1000   634846.49         283
6   2007-11-01      1000   500420.98         323
7   2007-12-01      1000   561449.89         287
8   2008-01-01      1000   630137.22         325
9   2008-02-01      1000   337043.47         204
10  2008-03-01      1000   425599.09         267
11  2008-04-01      1000   677194.97         301
12  2008-05-01      1000   474962.34         263
13  2008-06-01      1000   383710.84         237

In [273]:
2 * 365 * 10000

7300000

## Джойн таблицы самой на себя (нарастающий итог)

In [274]:
t = pd.DataFrame({'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03'],format='%Y-%m-%d'),
                  'revenue':[1,2,3]})

In [275]:
t

          dt  revenue
0 2021-04-01        1
1 2021-04-02        2
2 2021-04-03        3

In [276]:
t.to_sql('revenue',con,index=False,if_exists='replace')

In [277]:
sql = '''
SELECT 
  t.dt,
  t.revenue, 
  SUM(r.revenue) AS cumsum 
FROM 
  revenue t
JOIN 
  revenue r ON r.dt <= t.dt 
GROUP BY 
  t.dt, t.revenue'''

In [278]:
select(sql)

                    dt  revenue  cumsum
0  2021-04-01 00:00:00        1       1
1  2021-04-02 00:00:00        2       3
2  2021-04-03 00:00:00        3       6

# Оконные функции

## Примеры

In [281]:
sql = '''
SELECT 
  t.*,
  SUM(t.revenue) OVER (ORDER BY t.dt) AS cum_sum
FROM 
  revenue t'''

In [282]:
select(sql)

                    dt  revenue  cum_sum
0  2021-04-01 00:00:00        1        1
1  2021-04-02 00:00:00        2        3
2  2021-04-03 00:00:00        3        6

In [283]:
t = pd.DataFrame({'user_id':[1,1,1,2,2,2],
                  'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03',
                                      '2021-04-01','2021-04-02','2021-04-03'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,2,3,4]})

In [284]:
t

   user_id         dt  revenue
0        1 2021-04-01        1
1        1 2021-04-02        2
2        1 2021-04-03        3
3        2 2021-04-01        2
4        2 2021-04-02        3
5        2 2021-04-03        4

In [285]:
t.to_sql('revenue',con,index=False,if_exists='replace')

In [286]:
sql = '''
SELECT 
  t.*,
  SUM(t.revenue) OVER (PARTITION BY t.user_id ORDER BY t.dt) AS cum_sum
FROM 
  revenue t'''

In [287]:
select(sql)

   user_id                   dt  revenue  cum_sum
0        1  2021-04-01 00:00:00        1        1
1        1  2021-04-02 00:00:00        2        3
2        1  2021-04-03 00:00:00        3        6
3        2  2021-04-01 00:00:00        2        2
4        2  2021-04-02 00:00:00        3        5
5        2  2021-04-03 00:00:00        4        9

## Rank и row_number

In [288]:
t = pd.DataFrame({'user_id':[1,1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03','2021-04-03',
                                                                 '2021-04-03','2021-04-04','2021-04-05'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,1,2,3,4]})

In [289]:
t.to_sql('revenue',con,index=False,if_exists='replace')

In [291]:
sql = '''
SELECT 
  * 
FROM 
  revenue t'''

In [292]:
select(sql)

   user_id                   dt  revenue
0        1  2021-04-01 00:00:00        1
1        1  2021-04-02 00:00:00        2
2        1  2021-04-03 00:00:00        3
3        1  2021-04-03 00:00:00        1
4        2  2021-04-03 00:00:00        2
5        2  2021-04-04 00:00:00        3
6        2  2021-04-05 00:00:00        4

In [295]:
sql = '''
SELECT 
  t.*,
  RANK() OVER (PARTITION BY t.user_id ORDER BY t.dt DESC) AS rnk
FROM 
  revenue t'''

In [296]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    1
2        1  2021-04-02 00:00:00        2    3
3        1  2021-04-01 00:00:00        1    4
4        2  2021-04-05 00:00:00        4    1
5        2  2021-04-04 00:00:00        3    2
6        2  2021-04-03 00:00:00        2    3

In [297]:
sql = '''
WITH dt_rank AS (
SELECT 
  t.*,
  RANK() OVER (PARTITION BY t.user_id ORDER BY t.dt DESC) AS rnk
FROM 
  revenue t)
 
SELECT 
  * 
FROM 
  dt_rank t
WHERE 
  t.rnk = 1
 '''

In [298]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    1
2        2  2021-04-05 00:00:00        4    1

In [299]:
sql = '''
SELECT 
  t.*,
  ROW_NUMBER() OVER (PARTITION BY t.user_id ORDER BY t.dt DESC) AS rnk
FROM 
  revenue t'''

In [300]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        1  2021-04-03 00:00:00        1    2
2        1  2021-04-02 00:00:00        2    3
3        1  2021-04-01 00:00:00        1    4
4        2  2021-04-05 00:00:00        4    1
5        2  2021-04-04 00:00:00        3    2
6        2  2021-04-03 00:00:00        2    3

In [301]:
sql = '''
WITH dt_rank AS (
SELECT 
  t.*,
  ROW_NUMBER() OVER (PARTITION BY t.user_id ORDER BY t.dt DESC) AS rnk
FROM 
  revenue t)
 
SELECT 
  * 
FROM 
  dt_rank t
WHERE 
  t.rnk = 1
 '''

In [302]:
select(sql)

   user_id                   dt  revenue  rnk
0        1  2021-04-03 00:00:00        3    1
1        2  2021-04-05 00:00:00        4    1

In [303]:
t = pd.DataFrame({'user_id':[1,1,1,2,2,2],'dt':pd.to_datetime(['2021-04-01','2021-04-02','2021-04-03',
                                                               '2021-04-03','2021-04-04','2021-04-05'],format='%Y-%m-%d'),
                  'revenue':[1,2,3,2,3,4]})

In [304]:
t.to_sql('revenue',con,index=False,if_exists='replace')

In [305]:
sql = '''
SELECT 
  t.user_id, 
  MAX(t.dt) AS max_dt 
FROM 
  revenue t
GROUP BY 
  1'''

In [306]:
select(sql)

   user_id               max_dt
0        1  2021-04-03 00:00:00
1        2  2021-04-05 00:00:00

In [307]:
sql = '''

WITH last_dt AS (
SELECT 
  t.user_id, 
  MAX(t.dt) AS max_dt 
FROM 
  revenue t
GROUP BY 
  1)

SELECT 
  t.* 
FROM 
  revenue t
JOIN 
  last_dt ld ON t.user_id = ld.user_id AND t.dt = ld.max_dt
'''

In [308]:
select(sql)

   user_id                   dt  revenue
0        1  2021-04-03 00:00:00        3
1        2  2021-04-05 00:00:00        4

## Топ 3 зарплаты в отделе

In [309]:
t = pd.DataFrame({'dep':['a','a','a','a','a',
                         'b','b','b','b','b'],
                  'emp':['aa','bb','cc','dd','ee',
                         'aa','bb','cc','dd','ee'],
                  'sal':[5,5,3,2,1,
                         5,4,3,2,1]})

In [310]:
t

  dep emp  sal
0   a  aa    5
1   a  bb    5
2   a  cc    3
3   a  dd    2
4   a  ee    1
5   b  aa    5
6   b  bb    4
7   b  cc    3
8   b  dd    2
9   b  ee    1

In [311]:
t.to_sql('salary',con,index=False,if_exists='replace')

In [312]:
sql = '''
SELECT 
  t.*,
  RANK() OVER (PARTITION BY t.dep ORDER BY t.sal DESC) AS rnk_rank,
  DENSE_RANK() over (PARTITION BY t.dep ORDER BY t.sal DESC) AS rnk
FROM 
  salary t'''

In [313]:
select(sql)

  dep emp  sal  rnk_rank  rnk
0   a  aa    5         1    1
1   a  bb    5         1    1
2   a  cc    3         3    2
3   a  dd    2         4    3
4   a  ee    1         5    4
5   b  aa    5         1    1
6   b  bb    4         2    2
7   b  cc    3         3    3
8   b  dd    2         4    4
9   b  ee    1         5    5

In [ ]:
sql = '''

WITH salary_rnk AS (
SELECT 
  t.*,
  DENSE_RANK() OVER (PARTITION BY t.dep ORDER BY t.sal desc) AS rnk
FROM 
  salary t)
 
SELECT 
  * 
FROM 
  salary_rnk t
WHERE 
  t.rnk <= 3 
 '''

In [ ]:
select(sql)

  dep emp  sal  rnk
0   a  aa    5    1
1   a  bb    5    1
2   a  cc    3    2
3   a  dd    2    3
4   b  aa    5    1
5   b  bb    4    2
6   b  cc    3    3

## Клиентские сессии

In [314]:
user1 = pd.DataFrame({'user_id':[1,1,1,1,1],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 12:31',
                                       '2021-04-03 07:31'],format='%Y-%m-%d %H:%M')})

In [315]:
user1

   user_id                  dt
0        1 2021-04-01 07:31:00
1        1 2021-04-01 07:35:00
2        1 2021-04-01 08:20:00
3        1 2021-04-01 12:31:00
4        1 2021-04-03 07:31:00

In [316]:
user2 = pd.DataFrame({'user_id':[2,2,2,2],
                      'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35','2021-04-01 08:20','2021-04-01 9:10'],format='%Y-%m-%d %H:%M')})

In [320]:
user3 = pd.DataFrame({'user_id':[3,3,3],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-02 07:35','2021-04-03 08:20'],format='%Y-%m-%d %H:%M')})

In [321]:
t = pd.concat([user1,user2,user3])

In [322]:
t

   user_id                  dt
0        1 2021-04-01 07:31:00
1        1 2021-04-01 07:35:00
2        1 2021-04-01 08:20:00
3        1 2021-04-01 12:31:00
4        1 2021-04-03 07:31:00
0        2 2021-04-01 07:31:00
1        2 2021-04-01 07:35:00
2        2 2021-04-01 08:20:00
3        2 2021-04-01 09:10:00
0        3 2021-04-01 07:31:00
1        3 2021-04-02 07:35:00
2        3 2021-04-03 08:20:00

In [323]:
t.to_sql('client_log',con,index=False,if_exists='replace')

In [324]:
sql = '''
SELECT 
  * 
FROM 
  client_log t'''

In [325]:
select(sql)

    user_id                   dt
0         1  2021-04-01 07:31:00
1         1  2021-04-01 07:35:00
2         1  2021-04-01 08:20:00
3         1  2021-04-01 12:31:00
4         1  2021-04-03 07:31:00
5         2  2021-04-01 07:31:00
6         2  2021-04-01 07:35:00
7         2  2021-04-01 08:20:00
8         2  2021-04-01 09:10:00
9         3  2021-04-01 07:31:00
10        3  2021-04-02 07:35:00
11        3  2021-04-03 08:20:00

In [326]:
24 * 60 * 60

86400

In [327]:
sql = '''
WITH new_session AS (
SELECT 
  t.*,
  LAG(t.dt) OVER (PARTITION BY t.user_id ORDER BY t.dt) AS prev_dt,
  ROUND((JULIANDAY(t.dt) - JULIANDAY(lag(t.dt) OVER (PARTITION BY t.user_id ORDER BY t.dt))) * 24 * 60 * 60) AS dt_diff,
  CASE WHEN ROUND((JULIANDAY(t.dt) - JULIANDAY(LAG(t.dt) OVER (PARTITION BY t.user_id ORDER BY t.dt))) * 24 * 60 * 60) >= 3600
       THEN 1 ELSE 0 END AS new_session
FROM 
  client_log t),

client_sessions AS (
SELECT 
  t.*,
  SUM(t.new_session) OVER (PARTITION BY t.user_id ORDER BY t.dt) AS session_id
FROM 
  new_session t),

client_sessions_agg AS (
SELECT
  t.user_id, 
  t.session_id, 
  COUNT(*) AS action_cnt 
FROM 
  client_sessions t
GROUP BY 
  1,2)

SELECT 
  COUNT(*) 
FROM 
  client_sessions_agg t
 '''

In [328]:
select(sql)

   COUNT(*)
0         7

## Скользящее среднее

In [329]:
t = pd.DataFrame({'user_id':[1,1,1,1,1,1,
                             2,2,2,2,2],
                  'dt':[1,2,3,4,5,6,
                        1,2,3,4,5],
                  'revenue':[1,2,3,4,5,6,
                             3,4,5,6,7]})

In [330]:
t.to_sql('revenue',con,index=False,if_exists='replace')

In [335]:
sql = '''
SELECT 
  t.*,
  AVG(t.revenue) OVER (PARTITION BY t.user_id ORDER BY t.dt ROWS BETWEEN 2 PRECEDING AND CURRENT ROW) AS moving_avg
FROM 
  revenue t'''

In [336]:
select(sql)

    user_id  dt  revenue  moving_avg
0         1   1        1         1.0
1         1   2        2         1.5
2         1   3        3         2.0
3         1   4        4         3.0
4         1   5        5         4.0
5         1   6        6         5.0
6         2   1        3         3.0
7         2   2        4         3.5
8         2   3        5         4.0
9         2   4        6         5.0
10        2   5        7         6.0